Конфигурация/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <registerRecords>AccumulationRegister.ДоставкиИОплаты</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Велосипеды</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БаллыНаСписание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПозицииПродажи</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/Заказ/Forms/ФормаЗаказа/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Тест
	Элементы.ТЕСТ_1.Видимость = Ложь;
	
	// Реквизиты
	МаксимальнаяДоляОплатыБаллами = Константы.МаксимальнаяДоляОплатыБаллами.Получить();
	ИнформацияОКлиенте = ОбщийМодульВызовСервера.ПолучитьИнформациюОКлиенте(
		Объект.Ссылка,
		Объект.Дата,
		Объект.Клиент,
		Объект.Цена
	);
	СуммаБалловОстаток = ИнформацияОКлиенте.СуммаБалловОстаток;
	ПроцентНакопления = ИнформацияОКлиенте.ПроцентНакопления;
	БаллыКНакоплению = ИнформацияОКлиенте.БаллыКНакоплению;
	ОбщийМодульВызовСервера.СоздатьДекорацииИзбранныхТоваров(ЭтотОбъект, Элементы);
	
	// Общие настройки всех подобных форм
	ОбщийМодульВызовСервера.ПридатьНачальныйВидФормеЗаказа(ЭтотОбъект, Объект, Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Параметры)
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, Объект.ПозицииПродажи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьФормуЗаказа" Тогда

		Если ЗначениеЗаполнено(Объект.Клиент) Тогда
			ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, Объект.ПозицииПродажи);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БаллыНаСписаниеПриИзменении(Элемент)
	
	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, Объект.ПозицииПродажи);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	ОбщийМодульКлиент.ПолучитьБаллыИПоказатьИнформацию(
		Объект.Ссылка,
		ЭтотОбъект,
		Объект,
		Объект.Дата,
		Объект.Цена,
		Объект.Клиент,
		МаксимальнаяДоляОплатыБаллами
	);
	
	КлиентПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБаллыКлиентаОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка
	)
	
	ОбщийМодульКлиент.БаллыОбработкаСсылки(
		Объект,
		Объект.БаллыНаСписание,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка
	);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииПродажи

&НаКлиенте
Процедура ПозицииПродажиТоварПриИзменении(Элемент)
	
	ОбщийМодульКлиент.ТоварПриИзменении(
		ЭтотОбъект,
		Объект,
		Объект.ПозицииПродажи,
		Элементы.ПозицииПродажи.ТекущиеДанные
	);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиКоличествоПриИзменении(Элемент)
	
	ОбщийМодульКлиент.ПосчитатьИЗаписатьСуммуПозиции(Элементы.ПозицииПродажи.ТекущиеДанные);
	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, Объект.ПозицииПродажи);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиПослеУдаления(Элемент)

	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, Объект.ПозицииПродажи);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТЕСТ_1(Команда)

	ИнформацияОКлиенте = ОбщийМодульВызовСервера.ПолучитьИнформациюОКлиенте(
		Объект.Ссылка,
		Объект.Дата,
		Объект.Клиент,
		Объект.Цена
	);
	
	ОбщийМодульКлиент.ВывестиСтруктуру(ИнформацияОКлиенте);
	
	ТЕСТ_1НаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Подключаемый декорация избранных товаров нажатие.
// 
// Параметры:
//  Элемент - ДекорацияФормы
&НаКлиенте
Процедура Подключаемый_ДекорацияИзбранныхТоваровНажатие(Элемент)

	ОбщийМодульКлиент.ИзбранныеНажатие(
		ЭтотОбъект,
		Объект,
		Объект.ПозицииПродажи,
		Элемент,
		ДинамическиеЭлементы
	);

КонецПроцедуры

&НаСервере
Процедура КлиентПриИзмененииНаСервере()

	ОбщийМодульВызовСервера.ЗаполнитьИзбранныеТовары(
		ЭтотОбъект,
		ДинамическиеЭлементы,
		Объект.Клиент
	);

КонецПроцедуры

&НаСервере
Процедура ТЕСТ_1НаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

//#Область ОписаниеПеременных
//
//#КонецОбласти
